package by.htp.les02.main;

public class Main1 {

	/*
	 * Даны два действительных числа х и у. Вычислить их сумму, разность,
	 * произведение и частное.
	 */

	public static void main(String[] args) {
		double x = 2.5;
		double y = 1.5;
		double s, d, p, q;
		s = x + y;
		d = x - y;
		p = x * y;
		q = x / y;
		System.out.println("s = " + s + '\n' + "d = " + d + '\n' + "p = " + p + '\n' + "q = " + q);
	}

}
