package by.htp.les02.main;

public class Main7 {

	/*
	 * Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь
	 * прямоугольника
	 */

	public static void main(String[] args) {
		double sh = 2.5;
		double dl = 2 * sh;
		double s = sh * dl;
		System.out.println("s = " + s);
	}

}
