package by.htp.les02.main;

public class Main18 {

	/*
	 * Дана длина ребра куба. Найти площадь грани, площадь полной поверхности и
	 * объем этого куба.
	 */

	public static void main(String[] args) {
		double l = 3.5;
		double s1 = l * l;
		double S = s1 * 6;
		double V = s1 * l;
		System.out.println("s1 = " + s1 + "\nS = " + S + "\nV = " + V);
	}

}
