package by.htp.les02.main;

public class Main15 {

	/*
	 * Написать программу, которая выводит на экран первые четыре степени числа π.
	 */

	public static void main(String[] args) {
		System.out.println(Math.PI + "\n" + Math.PI * Math.PI + "\n" + Math.PI * Math.PI * Math.PI + "\n"
				+ Math.PI * Math.PI * Math.PI * Math.PI);
	}

}
