package by.htp.les02.main;

public class Main25 {

	/*
	 * Написать программу — модель анализа пожарного датчика в помещении, которая
	 * выводит сообщение «Пожароопасная ситуация », если температура в комнате
	 * превысила 60° С.
	 */

	public static void main(String[] args) {
		double t = 73;
		if (t > 60) {
			System.out.println("Пожароопасная ситуация ");
		}
	}

}
