package by.htp.les02.main;

public class Main24 {

	/*
	 * Составить программу, определяющую результат гадания на ромашке — «любит—не
	 * любит», взяв за исходное данное количество лепестков п.
	 */

	public static void main(String[] args) {
		int n = 8;
		if (n % 2 == 1) {
			System.out.println("Любит.");
		} else {
			System.out.println("Не любит.");
		}
	}

}
